Revit 2027 API
SlabShapeEditor.AddPoint Method
 Add a point to the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SlabShapeVertex AddPoint(
	XYZ point
)
Public Function AddPoint (
	point As XYZ
) As SlabShapeVertex
public:
SlabShapeVertex^ AddPoint(
	XYZ^ point
)
member AddPoint :
        point : XYZ -> SlabShapeVertex
Parameters
point XYZ
Return Value
SlabShapeVertex
 the newly added slab shape vertex.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The newly added point should be inside the element boundary on the x-y plane. SlabShapeEditor must be enabled before calling this method. Regenerate the document after element creation if this method is called in the same transaction.
See Also
Reference
SlabShapeEditor Class
Autodesk.Revit.DB Namespace